let vh = window.innerHeight * 0.01;
document.documentElement.style.setProperty("--vh", `${vh}px`);
// Логика мобильного меню
let hamburger = document.querySelector("button.hamburger "),
    navMenu = document.querySelector(".navigation");

hamburger.addEventListener("click", function (e) {
    hamburger.classList.toggle("is-active");
    navMenu.classList.toggle("opened");
    document.body.classList.toggle("unscrollable");
});



// Рейтинг товаров
let ratings = document.querySelectorAll(".product__about__rating");
ratings.forEach(function (ratingField) {
    var rating = ratingField.getAttribute("data-rating");
    for (let i = 0; i < 5 - rating; i++) {
        let star = document.createElement("span");
        star.classList.add("star");
        star.innerHTML = `<svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M6.549 0.926956C6.849 0.00595603 8.152 0.00595603 8.451 0.926956L9.521 4.21896C9.58638 4.41944 9.71345 4.59414 9.88408 4.71806C10.0547 4.84199 10.2601 4.9088 10.471 4.90896H13.933C14.902 4.90896 15.304 6.14896 14.521 6.71896L11.721 8.75296C11.55 8.87699 11.4227 9.05197 11.3573 9.25281C11.2919 9.45365 11.2918 9.67004 11.357 9.87096L12.427 13.163C12.727 14.084 11.672 14.851 10.887 14.281L8.087 12.247C7.91621 12.123 7.71056 12.0562 7.49951 12.0562C7.28845 12.0562 7.0828 12.123 6.912 12.247L4.112 14.281C3.328 14.851 2.274 14.084 2.573 13.163L3.643 9.87096C3.70818 9.67004 3.70806 9.45365 3.64267 9.25281C3.57728 9.05197 3.44997 8.87699 3.279 8.75296L0.480005 6.71996C-0.302995 6.14996 0.100005 4.90996 1.068 4.90996H4.529C4.74005 4.91001 4.94571 4.84329 5.11653 4.71935C5.28735 4.59541 5.41458 4.42061 5.48 4.21996L6.55 0.927956L6.549 0.926956Z" fill="#000" fill-opacity="0.4"/></svg>`;
        ratingField.appendChild(star);
    }
    for (let i = 0; i < rating; i++) {
        let star = document.createElement("span");
        star.classList.add("star");
        star.innerHTML = `<svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M6.549 0.926956C6.849 0.00595603 8.152 0.00595603 8.451 0.926956L9.521 4.21896C9.58638 4.41944 9.71345 4.59414 9.88408 4.71806C10.0547 4.84199 10.2601 4.9088 10.471 4.90896H13.933C14.902 4.90896 15.304 6.14896 14.521 6.71896L11.721 8.75296C11.55 8.87699 11.4227 9.05197 11.3573 9.25281C11.2919 9.45365 11.2918 9.67004 11.357 9.87096L12.427 13.163C12.727 14.084 11.672 14.851 10.887 14.281L8.087 12.247C7.91621 12.123 7.71056 12.0562 7.49951 12.0562C7.28845 12.0562 7.0828 12.123 6.912 12.247L4.112 14.281C3.328 14.851 2.274 14.084 2.573 13.163L3.643 9.87096C3.70818 9.67004 3.70806 9.45365 3.64267 9.25281C3.57728 9.05197 3.44997 8.87699 3.279 8.75296L0.480005 6.71996C-0.302995 6.14996 0.100005 4.90996 1.068 4.90996H4.529C4.74005 4.91001 4.94571 4.84329 5.11653 4.71935C5.28735 4.59541 5.41458 4.42061 5.48 4.21996L6.55 0.927956L6.549 0.926956Z" fill="#FFA049"/></svg>`;
        ratingField.appendChild(star);
    }
});

// Модальные окна
function hideDialog(dialog) {
    dialog.classList.add("hide");
    dialog.addEventListener(
        "webkitAnimationEnd",
        function () {
            dialog.classList.remove("hide");
            dialog.close();
            dialog.removeEventListener(
                "webkitAnimationEnd",
                arguments.callee,
                false
            );
        },
        false
    );
}
function showDialog(dialog) {
    dialog.showModal();
    document.body.style.top = `-${window.scrollY}px`;
    document.body.classList.toggle("unscrollable");
}
document.querySelectorAll("[data-modal-target]").forEach(function (btn) {
    btn.addEventListener("click", function (e) {
        showDialog(
            document.getElementById(btn.getAttribute("data-modal-target"))
        );
    });
});
document.querySelectorAll("button.close-modal").forEach(function (btn) {
    btn.addEventListener("click", function (e) {
        hideDialog(btn.closest("dialog"));
    });
});
document.querySelectorAll("dialog").forEach(function (dialog) {
    dialog.addEventListener("click", function (e) {
        const rect = dialog.getBoundingClientRect();
        if (
            e.clientY < rect.top ||
            e.clientY > rect.bottom ||
            e.clientX < rect.left ||
            e.clientX > rect.right
        ) {
            hideDialog(dialog);
        }
    });
    dialog.addEventListener("close", function (e) {
        const scrollY = document.body.style.top;
        document.body.classList.toggle("unscrollable");
        window.scrollTo(0, parseInt(scrollY || '0') * -1);
        document.body.style.top = ``;
    });
});

// Плавный скролл
const smoothLinks = document.querySelectorAll(".smooth-scroll");
for (let smoothLink of smoothLinks) {
    smoothLink.addEventListener("click", function (e) {
        e.preventDefault();
        const id = smoothLink.getAttribute("href");
        document.querySelector(id).scrollIntoView({
            behavior: "smooth",
            block: "start",
        });
    });
}

// _______________ПОИСК______________________
let toysForSearch = ["Игрушки для мальчиков",
    "Мягкие игрушки",
    "Игрушки для девочек",
    "Конструкторы",
    "Игрушечный транспорт",
    "Фигурки и аксессуары",
    "Куклы и аксессуары",
    "Настольные игры для детей",
    "Развивающие игрушки и игры",
    "Игровые наборы",
    "Сюжетно-ролевые игрушки",
    "Игрушки-антистресс",
    "Роботы и трансформеры",
    "Интерактивные и электронные игрушки",
    "Игрушечное оружие",
    "Игрушки для новорожденных до 2 лет",
    "Игрушки для ванной",
    "Радиоуправляемые игрушки",
    "Подвижные игры",
    "Подарочные наборы игрушек",
    "Игровые комплексы для дома и улицы",
    "Машинка",
    "Пластиковый конструктор",
    "Машинка радиоуправляемая",
    "Автомат игрушечный",
    "Аккумулятор для квадрокоптера",
    "Аксессуар для вигвама",
    "Аксессуар для игрового комплекса",
    "Аксессуар для квадрокоптера",
    "Аксессуар для кукол",
    "Аксессуар для машинок",
    "Аксессуар для радиоуправляемых моделей",
    "Аксессуар для рюкзака-переноски",
    "Аксессуар для спортивного комплекса",
    "Аксессуар для треков",
    "Аксессуар для фигурок",
    "Аксессуары для бластера",
    "Анатомическая модель",
    "Арбалет игрушечный",
    "Балансир",
    "Батут детский",
    "Башенный кран радиоуправляемый",
    "Бизиборд",
    "Бластер",
    "Брелок",
    "Бумажный конструктор",
    "Вагон",
    "Вертолет",
    "Вертолет радиоуправляемый",
    "Вертушка",
    "Вигвам детский",
    "Водное оружие",
    "Водные бомбочки",
    "Водный транспорт",
    "Водяной пистолет",
    "Гибкий трек",
    "Головоломка",
    "Гранатомет игрушечный",
    "Деревянная модель",
    "Деревянный конструктор",
    "Детская горка",
    "Детские качели",
    "Детский дартс",
    "Детский музыкальный инструмент",
    "Диапроектор",
    "Диафильм",
    "Дискострел игрушечный",
    "Домик-раскраска",
    "Домино",
    "Домино детское",
    "Дополнение для настольных игр",
    "Дополнительный модуль для игрового комплекса",
    "Дополнительный модуль для спорткомплекса",
    "Дополнительный элемент для железной дороги",
    "Доспехи игрушечные",
    "Жвачка для рук",
    "Железная дорога",
    "Заводная игрушка",
    "Запчасти для радиоуправляемых машинок",
    "Запчасти для самолетов",
    "Запчасть для радиоуправляемых моделей",
    "Зарядное устройство для квадрокоптера",
    "Игровой городок",
    "Игровой домик",
    "Игровой коврик",
    "Игровой комплекс для детей",
    "Игровой набор с куклой",
    "Игровой тоннель",
    "Игрушечный робот",
    "Игрушечный трек",
    "Игрушка антистресс",
    "Игрушка велосипед",
    "Игрушка для ванной",
    "Игрушка для хранения первого зуба",
    "Игрушка из пластизоля",
    "Игрушка радиоуправляемая",
    "Игрушка-грелка",
    "Игрушка-каталка",
    "Игрушка-подвеска",
    "Игрушка-попрыгун",
    "Игрушка-стучалка",
    "Игрушка-тренажер для дыхания",
    "Интерактивная игрушка",
    "Йо-йо",
    "Калейдоскоп",
    "Картина",
    "Катер радиоуправляемый",
    "Квадрокоптер",
    "Квадроцикл радиоуправляемый",
    "Кирка игрушечная",
    "Книга-пазл",
    "Книжка-игрушка",
    "Кобура и ремни игрушечные",
    "Коврик-пазл",
    "Коллекционные фигурки по видеоиграм и фильмам",
    "Коляска для куклы",
    "Комфортер",
    "Конструктор из кирпичиков",
    "Конструктор липучка",
    "Кораблик",
    "Космический корабль",
    "Космический корабль радиоуправляемый",
    "Кубики",
    "Кукла",
    "Кукольный домик",
    "Кукольный театр",
    "Лабиринт",
    "Летающий спиннер",
    "Лопасти для квадрокоптера",
    "Лопата игрушечная",
    "Лото",
    "Лук игрушечный",
    "Магнитный конструктор",
    "Машина для кукол",
    "Мебель для кукол",
    "Металлический конструктор",
    "Меч игрушечный",
    "Микроскоп детский",
    "Мини-кукла",
    "Миномет игрушечный",
    "Мишень игрушечная",
    "Мобиль",
    "Модель для раскопок",
    "Мозаика",
    "Мотоцикл игрушечный",
    "Мотоцикл на радиоуправлении",
    "Музыкальная игрушка",
    "Мягкая игрушка",
    "Мягкая кукла",
    "Мягкий конструктор",
    "Мяч для детей",
    "Набор для лепки снеговика",
    "Набор для опытов",
    "Набор для подвижных игр",
    "Набор игрушечного оружия",
    "Набор настольных игр",
    "Набор солдатиков",
    "Надувная игрушка",
    "Надувной коврик",
    "Надувные ворота",
    "Нарды",
    "Настольная игра",
    "Неваляшка",
    "Нейроскакалка",
    "Нож игрушечный",
    "Обучающая игра",
    "Одежда для кукол",
    "Одежда для мягкой игрушки",
    "Оптический фильтр для квадрокоптера",
    "Пазл для малышей",
    "Палатка для игр",
    "Парковка",
    "Паровоз",
    "Патроны игрушечные",
    "Пенспиннинг",
    "Пирамидка",
    "Пистолет игрушечный",
    "Пистоны для игрушечного оружия",
    "Погремушка",
    "Погремушка-прорезыватель",
    "Подарочный набор игрушек",
    "Подводная лодка радиоуправляемая",
    "Подушка-игрушка",
    "Поезд радиоуправляемый",
    "Поп-ит",
    "Поп-туб",
    "Проектор",
    "Прорезыватель",
    "Пульт д/у для радиоуправляемой модели",
    "Пупс",
    "Пусковая игрушка",
    "Радиоконструкторы и модули",
    "Развивающая дуга",
    "Развивающая игрушка",
    "Развивающий коврик",
    "Развивающий центр",
    "Ракета игрушечная",
    "Рамка-вкладыш для малышей",
    "Рельсы",
    "Робот радиоуправляемый",
    "Рогатка игрушечная",
    "Ружье игрушечное",
    "Сабля игрушечная",
    "Самолет",
    "Самолет радиоуправляемый",
    "Сборная модель космического корабля",
    "Световой меч игрушечный",
    "Симпл-димпл",
    "Сквиш",
    "Слайм",
    "Слингобусы",
    "Снаперс",
    "Сортер",
    "Спиннер",
    "Стрелялка",
    "Сумка для квадрокоптера",
    "Сумочка - антистресс",
    "Таймер для спидкубинга",
    "Тактильный мяч",
    "Танк",
    "Танк радиоуправляемый",
    "Тарзанка",
    "Телескоп детский",
    "Тир игрушечный",
    "Топор игрушечный",
    "Трансформер",
    "Трансформер радиоуправляемый",
    "Фигурка",
    "Фигурка-сюрприз",
    "Фингерспорт",
    "Шар-трансформер",
    "Шарики для водяного пистолета",
    "Шахматы",
    "Шашки",
    "Шкатулка",
    "Шнуровка",
    "Щит игрушечный",
    "Электронная игрушка",
    "Электронный конструктор",
    "Юла"]

let sortedList = toysForSearch.sort();
let input = document.querySelector(".search-field input[type='text']");
let ul = document.querySelector(".search-field__suggestions")
input.addEventListener("keyup", (e) => {
    removeElements();
    for (let i of sortedList) {
        if (
            i.toLowerCase().includes(input.value.toLowerCase()) &&
            input.value != "" && ul.childElementCount < 8
        ) {
            let listItem = document.createElement("li");
            listItem.classList.add("list-items");
            listItem.style.cursor = "pointer";
            listItem.setAttribute("onclick", "displaySearch('" + i + "')");
            listItem.innerHTML = i;
            ul.appendChild(listItem);
        }
    }
});
function displaySearch(value) {
    input.value = value;
    document.querySelector(".search-field").submit()
    removeElements()
}
function removeElements() {
    let items = document.querySelectorAll(".list-items");
    items.forEach((item) => {
        item.remove();
    });
}
input.onblur = inputBlur;
function inputBlur() {
    if (input.value != "") {
        input.focus()
    };
}
